System design docs added
